In [1]:
import pandas as pd

# Creating a pandas dataframe

In [14]:
students={"Names":["Alpha","Mark","Paul","Rose","Mary","Thaddy","Astrid","Mavili","Miguel"],
         "Age":[30,28,43,39,49,26,1,2,10],
         "Country":["Nigeria","Cameroon","Cameroon","Indian","Canada","USA","USA","USA","USA"],
         "Scores":[12,10,15,14,17,10,13,27,14]}
df=pd.DataFrame(students)

In [4]:
df

    Names  Age   Country  Scores
0   Alpha   30   Nigeria      12
1    Mark   28  Cameroon      10
2    Paul   43  Cameroon      15
3    Rose   39    Indian      14
4    Mary   49    Canada      17
5  Thaddy   26       USA      10
6  Astrid    1       USA      13
7  Mavili    2       USA      27
8  Miguel   10       USA      14

# performing analysis

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.shape

(9, 4)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Names    9 non-null      object
 1   Age      9 non-null      int64
 2   Country  9 non-null      object
 3   Scores   9 non-null      int64
dtypes: int64(2), object(2)
memory usage: 416.0+ bytes

In [15]:
df.mean()

C:\Users\h\AppData\Local\Temp\ipykernel_9320\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Age       25.333333
Scores    14.666667
dtype: float64

In [16]:
df.median()

C:\Users\h\AppData\Local\Temp\ipykernel_9320\530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

Age       28.0
Scores    14.0
dtype: float64

In [18]:
df.std()

C:\Users\h\AppData\Local\Temp\ipykernel_9320\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

Age       17.535678
Scores     5.147815
dtype: float64

In [19]:
df.max()

Names      Thaddy
Age            49
Country       USA
Scores         27
dtype: object

In [20]:
df.min()

Names         Alpha
Age               1
Country    Cameroon
Scores           10
dtype: object

In [21]:
df.count()

Names      9
Age        9
Country    9
Scores     9
dtype: int64

In [22]:
df.describe()

             Age     Scores
count   9.000000   9.000000
mean   25.333333  14.666667
std    17.535678   5.147815
min     1.000000  10.000000
25%    10.000000  12.000000
50%    28.000000  14.000000
75%    39.000000  15.000000
max    49.000000  27.000000

In [29]:
## indexing pandas dataframe
df.Age.mean()
## or
df["Age"].mean()

25.333333333333332

# data cleaning

In [30]:
df.columns

Index(['Names', 'Age', 'Country', 'Scores'], dtype='object')

In [33]:
df=df.rename(columns={"Country":"Countries"})
df
#or
df.rename(columns={"Country":"Countries"},inplace=True)

    Names  Age Countries  Scores
0   Alpha   30   Nigeria      12
1    Mark   28  Cameroon      10
2    Paul   43  Cameroon      15
3    Rose   39    Indian      14
4    Mary   49    Canada      17
5  Thaddy   26       USA      10
6  Astrid    1       USA      13
7  Mavili    2       USA      27
8  Miguel   10       USA      14

In [37]:
#calculating the mean of a particular culumn
Scoresmean=df.Scores.mean()
df["Scores"]=df["Scores"].fillna(Scoresmean)
df.count()

Names        9
Age          9
Countries    9
Scores       9
dtype: int64

In [ ]:
# dropping a column from a dataset
df=df.drop(columns=["insert the column to drop"])
df

# slicing

In [38]:
## calculating correlation coefitient
df.columns

Index(['Names', 'Age', 'Countries', 'Scores'], dtype='object')

In [40]:
df=df[[ 'Age','Scores']]
df.corr()

             Age    Scores
Age     1.000000 -0.294947
Scores -0.294947  1.000000

# Data Maniputation

In [47]:
df

    Names  Age   Country  Scores
0   Alpha   30   Nigeria      12
1    Mark   28  Cameroon      10
2    Paul   43  Cameroon      15
3    Rose   39    Indian      14
4    Mary   49    Canada      17
5  Thaddy   26       USA      10
6  Astrid    1       USA      13
7  Mavili    2       USA      27
8  Miguel   10       USA      14

# indexing by position

In [63]:
df.iloc[0:2:,2:4]

    Country  Scores
0   Nigeria      12
1  Cameroon      10

# indexing by label

In [74]:
df[["Names","Age"]] #indexing by label
 ## or
df.loc[:,"Age":"Scores"] #indexing by label for rangeof columns
 #or
df.loc[6:9,["Age","Country","Scores"]] #indexing by list of label

   Age Country  Scores
6    1     USA      13
7    2     USA      27
8   10     USA      14

In [77]:
# To change index labels to alphaberts
dummy=df.head(4)
dummy.index=["a","b","c","d"]
dummy

   Names  Age   Country  Scores
a  Alpha   30   Nigeria      12
b   Mark   28  Cameroon      10
c   Paul   43  Cameroon      15
d   Rose   39    Indian      14

In [121]:
df=pd.DataFrame(students)
df

    Names  Age   Country  Scores
0   Alpha   30   Nigeria      12
1    Mark   28  Cameroon      10
2    Paul   43  Cameroon      15
3    Rose   39    Indian      14
4    Mary   49    Canada      17
5  Thaddy   26       USA      10
6  Astrid    1       USA      13
7  Mavili    2       USA      27
8  Miguel   10       USA      14

In [122]:
# adding a new column
df["color"]="black"
df

    Names  Age   Country  Scores  color
0   Alpha   30   Nigeria      12  black
1    Mark   28  Cameroon      10  black
2    Paul   43  Cameroon      15  black
3    Rose   39    Indian      14  black
4    Mary   49    Canada      17  black
5  Thaddy   26       USA      10  black
6  Astrid    1       USA      13  black
7  Mavili    2       USA      27  black
8  Miguel   10       USA      14  black

In [131]:
df.loc[df[df["Age"]==30].index,["color"]]="black"
df.loc[df[df["Age"]==28].index,["color"]]="blue"
df.loc[df[df["Age"]==43].index,["color"]]="yello"
df.loc[df[df["Age"]==39].index,["color"]]="green"
df.loc[df[df["Age"]==49].index,["color"]]="red"
df.loc[df[df["Age"]==26].index,["color"]]="white"
df.loc[df[df["Age"]==1].index,["color"]]="pople"
df.loc[df[df["Age"]==2].index,["color"]]="cream"
df.loc[df[df["Age"]==10].index,["color"]]="blue"
df

    Names  Age   Country  Scores  color
0   Alpha   30   Nigeria      12  black
1    Mark   28  Cameroon      10   blue
2    Paul   43  Cameroon      15  yello
3    Rose   39    Indian      14  green
4    Mary   49    Canada      17    red
5  Thaddy   26       USA      10  white
6  Astrid    1       USA      13  pople
7  Mavili    2       USA      27  cream
8  Miguel   10       USA      14   blue

In [ ]:
df.loc[30:10,["Age","Country","Scores"]

# to store our work in a HDD

In [ ]:
df.to_csv("c://project file/created_practical_project.ipynb.csv")